# How it works - Python Pandas

* Author: Cleiber Garcia
* Version's date: March, 2023

* Pourpose: Develop competencies on how Python Pandas works

* This Notebook was produced as part of my studies of the course 'Python for Data Science and Machine Learning Bootcamp', taught by Mr Jose Portilla, Head of Data Science at Pierian Training. The course is offered ad Udemy (https://www.udemy.com/course/python-for-data-science-and-machine-learning-bootcamp/learn/lecture/5784218?start=15#overview). 

* Although the degree of similarity between this notebook and the notebook written by Jose Portillo for this course is almos 100%, I assure you that I wrote it line by line. Also, I took the liberty to make some changes in order to clariry some examples or to make code more readable, when I judged it apropriate.

* For more information, please contact me at cleiber.garcia@gmail.com

## Summary
* 1. Series
* 2. DataFrames
* 3. Missing Data
* 4. GroupBy
* 5. Merging,Joining,and Concatenating
* 6. Applying Functions
* 7. Pivot Tables
* 8. Data Input and Output

## 1. Series

### 1.1 Importing Python modules

In [1]:
import numpy as np
import pandas as pd

### 1.2 Creating a Series

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
my_array = np.array([10,20,30])
my_dictionary = {'a':10,'b':20,'c':30}

#### Using a list to create a Series

In [3]:
my_series_from_list = pd.Series(data=my_list)
my_series_from_list

0    10
1    20
2    30
dtype: int64

In [4]:
type(my_series_from_list)

pandas.core.series.Series

In [5]:
my_series_from_list_with_labels = pd.Series(data=my_list,index=labels)
my_series_from_list_with_labels

a    10
b    20
c    30
dtype: int64

#### Using a NumPy array to create a Series

In [6]:
my_series_from_array = pd.Series(my_array)
my_series_from_array

0    10
1    20
2    30
dtype: int32

In [7]:
my_series_from_array_with_labels = pd.Series(data=my_array, index=labels)
my_series_from_array_with_labels

a    10
b    20
c    30
dtype: int32

#### Using a dictionary to create a Series

In [8]:
my_series_dict = pd.Series(my_dictionary)
my_series_dict

a    10
b    20
c    30
dtype: int64

### 1.3 Data in a Series

In [9]:
# Creating a Series from labels list
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
# Creating a Series from three functions
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### 1.4 Using an Index Parameter When Creating a Series

In [11]:
# Create a Series with list [1,2,3,4] as content and 'USA'... as index labels
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
# Create a Series with list [1,2,5,4] as content and 'USA'... as index labels
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])  
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
# Show the content of ser1 at the third position
ser1[2]

3

In [14]:
# Show the content of ser1 with index label = "USA"
ser1["USA"]

1

In [15]:
# Add (combine) ser1 and ser2 in a single list with elements of both list. 
# NaN means that the element is in one of the lists only
print(ser1 + ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## 2. Pandas DataFrames

### 2.1 Creating a Pandas DataFrame

In [16]:
# Importing Python modules
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [19]:
# Show DataFrame's columns' names
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [20]:
# Show DataFrame's indexes
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

### 2.2 Selecting and Indexing

In [21]:
# Show the contents of column W
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
# Show the contents of columns W and Z
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
# Show the contents of columns W and Z
columns = ['W', 'Z']
df[columns]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [24]:
type(df['W']) # columns in a DataFrame are just Series

pandas.core.series.Series

In [25]:
# Creating a working DataFrame
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
# Sort the values of col2
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [27]:
# Show unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [28]:
# Show number of unique values
df['col2'].nunique()

3

In [29]:
# Count the number of values pertaining to column 2
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [30]:
# Selecting from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [31]:
# Show DataFrame df
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [32]:
# Check for null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### 2.3 Creating and Removing Columns in a DataFrame

In [33]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [34]:
# Creating a new column as addition of columns W and Y
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [35]:
# Drop column 'new' (inplace was not specified)
df.drop('new',axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [36]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [37]:
# Drop column 'new' with inplace=True
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [38]:
# Drop index with label D
df.drop('D', axis=0, inplace=True)
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
E -0.925874  1.862864 -1.133817  0.610478

In [39]:
# Show the DataFrame df
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
E -0.925874  1.862864 -1.133817  0.610478

In [40]:
del df['X']

In [41]:
df

          W         Y         Z
A -0.993263 -1.136645  0.000366
B  1.025984 -0.031579  0.649826
C  2.154846 -0.755325 -0.346419
E -0.925874 -1.133817  0.610478

### 2.4 Selecting Rows and Columns from a DataFrame

In [42]:
# List the row's content based on its label
df.loc['A']

W   -0.993263
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [43]:
# List the row's content based on its index
df.iloc[0]

W   -0.993263
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [44]:
# Select rows A, B, E and columns W, Z
df.loc[['A', 'B', 'E'], ['W', 'Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
E -0.925874  0.610478

### 2.5 Conditional Selection

In [45]:
# Creating a DataFrame
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [46]:
# Test if DataFrame's values are greater than zero
df > 0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [47]:
# Show the DataFrame's values greater than zero only
mask = df > 0
df[mask]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [48]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [49]:
# Test if W's values are greater than zero
df['W'] > 0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [50]:
# Show the DataFrame with W's values that are greater than zero
mask = df['W'] > 0
df[mask]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [51]:
# Show the values of Y for which W's values are greater than zero
mask = df['W'] > 0
df[mask]['Y']

A   -0.376519
B   -0.031160
E   -1.046780
Name: Y, dtype: float64

In [52]:
# Show DataFrame's values for which W's values are positive and Y'values are greater than 0.5
df[(df['W']>0) & (df['Y'] > 0.5)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [53]:
# Show DataFrame's values for which W's values are positive and Y'values are greater than 0.5
mask1 = df['W'] > 0
mask2 = df['Y'] > 0.5
df[mask1 & mask2]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

### 2.6 Changing DataFrame's Indexes

In [54]:
# Creating a DataFrame
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [55]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [56]:
# Create a variable states with values 'CA NY WY OR CO'
states = 'CA NY WY OR CO'.split()
states

['CA', 'NY', 'WY', 'OR', 'CO']

In [57]:
# Create a new column States
df['States'] = states
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [58]:
# Set States as the new index of the DataFrame
df.set_index('States', inplace=True)
df

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

### 2.7 Multi-Index and Index Hierarchy

In [59]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [60]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [61]:
inside

[1, 2, 3, 1, 2, 3]

In [62]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [63]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
# Create a DataFrame with 6 rows and 2 columns
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.606780 -1.115710
   2 -1.385379 -1.329660
   3  0.041460 -0.411055
G2 1 -0.771329  0.110477
   2 -0.804652  0.253548
   3  0.649148  0.358941

In [66]:
# Show group G1
df.loc['G1']

          A         B
1  1.606780 -1.115710
2 -1.385379 -1.329660
3  0.041460 -0.411055

In [67]:
# Show row 1 of group G1
df.loc['G1'].loc[1]

A    1.60678
B   -1.11571
Name: 1, dtype: float64

In [68]:
# Show index names
df.index.names

FrozenList([None, None])

In [69]:
# Set index names
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    1.606780 -1.115710
      2   -1.385379 -1.329660
      3    0.041460 -0.411055
G2    1   -0.771329  0.110477
      2   -0.804652  0.253548
      3    0.649148  0.358941

In [70]:
# Show values for DataFrame's index equal G1
df.xs('G1')

            A         B
Num
1    1.606780 -1.115710
2   -1.385379 -1.329660
3    0.041460 -0.411055

In [71]:
# Show values for DataFrame's index equal G1 (outside) and 1 (inside)
df.xs(['G1',1])

C:\Users\PC-IO\AppData\Local\Temp\ipykernel_1372\3299590512.py:2: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    1.60678
B   -1.11571
Name: (G1, 1), dtype: float64

In [72]:
# Show values for DataFrame index 1 for level Num (inside)
df.xs(1,level='Num')

              A         B
Group
G1     1.606780 -1.115710
G2    -0.771329  0.110477

## 3. Missing Data

Working with methods to deal with `missing data` in pandas:

### 3.1 Creating a Working DataFrame

In [73]:
# Importing Python modules
import numpy as np
import pandas as pd

In [74]:
# Creating a DataFrame
df = pd.DataFrame({'A':[1,2,np.nan,3,4,5],
                  'B':[5,np.nan,np.nan,np.nan,555,5555],
                  'C':[1,2,3,np.nan,np.nan,8],
                  'D':['X', 'Y', 'Z', 'W', 'H', 'J'],
                  'E':['W1', np.nan, np.nan, np.nan, np.nan, np.nan]
                  })

In [75]:
# Show the DataFrame created
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [76]:
# Drop rows with NaN Values
df.dropna()

     A    B    C  D   E
0  1.0  5.0  1.0  X  W1

In [77]:
# Show DataFrame df
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [78]:
# Drop rows with NaN Values
df.dropna()

     A    B    C  D   E
0  1.0  5.0  1.0  X  W1

In [79]:
# Show DataFrame df
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [80]:
# Change NaN values for something else ('$$$' for example)
df.fillna('$$$')

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     $$$  2.0  Y  $$$
2  $$$     $$$  3.0  Z  $$$
3  3.0     $$$  $$$  W  $$$
4  4.0   555.0  $$$  H  $$$
5  5.0  5555.0  8.0  J  $$$

### 3.2 Manipulating the Working DataFrame

In [81]:
# Delete columns that contains NaN
df.dropna(axis=1)

   D
0  X
1  Y
2  Z
3  W
4  H
5  J

In [82]:
# Since I did not use inplace=True when dropping NaN in last command, df was not modified
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [83]:
# Delete any column with Na NaN
df.dropna(axis=1)

   D
0  X
1  Y
2  Z
3  W
4  H
5  J

In [84]:
# Since I did not use inplace=True when dropping NaN in last command, df was not modified
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [85]:
# Count the number of NaN values in each row
for i in [0,1,2,3,4,5]:
    print(f'row: {i} -> ', 5 - df.iloc[i].isna().sum(), ' non-NaN values')

row: 0 ->  5  non-NaN values
row: 1 ->  3  non-NaN values
row: 2 ->  2  non-NaN values
row: 3 ->  2  non-NaN values
row: 4 ->  3  non-NaN values
row: 5 ->  4  non-NaN values

In [86]:
# Any row/column with the number of non-NA values < thresh value is removed 
# In this case, lines with index 2 and 3 will be removed, cause its number of non-NaN values is less than 3
df.dropna(thresh=3)

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [87]:
# Any row/column with the number of non-NA values < thresh value is removed 
# Lines with index 1, 2, 3 and 4 will be removed, cause its number of non-NaN values is less than 4
df.dropna(thresh=4)

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
5  5.0  5555.0  8.0  J  NaN

In [88]:
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [89]:
# Fill NaN values with the value 888
df.fillna(value=888)

       A       B      C  D    E
0    1.0     5.0    1.0  X   W1
1    2.0   888.0    2.0  Y  888
2  888.0   888.0    3.0  Z  888
3    3.0   888.0  888.0  W  888
4    4.0   555.0  888.0  H  888
5    5.0  5555.0    8.0  J  888

In [90]:
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  NaN     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

In [91]:
# Fill NaN values of column 'A' with the mean of the non-NaN values of column 'A'
df['A'] = df['A'].fillna(value=df['A'].mean())
df

     A       B    C  D    E
0  1.0     5.0  1.0  X   W1
1  2.0     NaN  2.0  Y  NaN
2  3.0     NaN  3.0  Z  NaN
3  3.0     NaN  NaN  W  NaN
4  4.0   555.0  NaN  H  NaN
5  5.0  5555.0  8.0  J  NaN

## 4. GroupBy
The groupby method allows us to group rows of data together and call aggregate functions

### 4.1 Creating a Working DataFrame

In [92]:
# Importing Pandas module
import pandas as pd

In [93]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Month':['July', 'August', 'August', 'August', 'July', 'August']}

In [94]:
df = pd.DataFrame(data)
df

  Company   Person  Sales   Month
0    GOOG      Sam    200    July
1    GOOG  Charlie    120  August
2    MSFT      Amy    340  August
3    MSFT  Vanessa    124  August
4      FB     Carl    243    July
5      FB    Sarah    350  August

### 4.2 Grouping Rows

In [95]:
# Group together rows of the same company
by_company = df.groupby("Company")
by_company

In [96]:
# Group together rows of the same month
by_month = df.groupby("Month")
by_month

### 4.3 Statistics on the Grouped Rows

In [97]:
# Show  average sales by company
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [98]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [99]:
# Show average sales by month
df.groupby('Month').mean()

        Sales
Month
August  233.5
July    221.5

In [100]:
# Show average sales by month
by_month.mean()

        Sales
Month
August  233.5
July    221.5

In [101]:
# Show minimum sales by company
by_company.min()

          Person  Sales   Month
Company
FB          Carl    243  August
GOOG     Charlie    120  August
MSFT         Amy    124  August

In [102]:
# Show standard deviation of sales by company
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [103]:
# Count the number of occurences for each numeric column (by company)
by_company.count()

         Person  Sales  Month
Company
FB            2      2      2
GOOG          2      2      2
MSFT          2      2      2

In [104]:
# Count the number of occurences for each numeric column (by month)
by_month.count()

        Company  Person  Sales
Month
August        4       4      4
July          2       2      2

In [105]:
# Show statistics by company
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [106]:
# Show statistics by company
by_company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [107]:
# Show statistics by month
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [108]:
# Show statistics by month
by_company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [109]:
# Show statistics for Google ('GOOG') Company
by_company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## 5. Merging, Joining and Concatenating
Merging, Joining and Concatenating are 3 main ways of combining DataFrames together

### 5.1 Concatenation

* Concatenation glues together DataFrames
* DataFrame's dimensions should match along the axis we are concatenating on
* We use **.concat()** and pass in a list of DataFrames to concatenate together

In [110]:
# Importing Pandas module
import pandas as pd

In [111]:
# Creating DataFrame df1
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [112]:
# Creating DataFrame df2
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [113]:
# Creating DataFrame df3
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [114]:
# Concatenate together DataFrames df1, df2 and df3 
# along the axis of rows (under the same columns)
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [115]:
# Concatenate together DataFrames df1, df2 and df3 
# along the axis of columns
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 5.2 Merging
The **merge** function allows us to merge DataFrames together based on the same key

#### 5.3.1 Merging DataFrames with one key

In [116]:
right_1k = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3', 'K5'],
                          'C': ['C0', 'C1', 'C2', 'C3', 'C5'],
                          'D': ['D0', 'D1', 'D2', 'D3', 'D5']})  
right_1k

  key1   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3
4   K5  C5  D5

In [117]:
left_1k = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3', 'K4'],
                     'A': ['A0', 'A1', 'A2', 'A3', 'A4'],
                     'B': ['B0', 'B1', 'B2', 'B3', 'B4']})
left_1k

  key1   A   B
0   K0  A0  B0
1   K1  A1  B1
2   K2  A2  B2
3   K3  A3  B3
4   K4  A4  B4

In [118]:
# Merge together the DataFrames left_1k and right_1k, 
# when rows of both DataFrames have the same key values
pd.merge(left_1k,right_1k,how='inner',on='key1')

  key1   A   B   C   D
0   K0  A0  B0  C0  D0
1   K1  A1  B1  C1  D1
2   K2  A2  B2  C2  D2
3   K3  A3  B3  C3  D3

In [119]:
# Merge together the DataFrames left_1k and right_1k,  when 
# rows of both DataFrames have the same key values
pd.merge(left_1k, right_1k, on='key1')

  key1   A   B   C   D
0   K0  A0  B0  C0  D0
1   K1  A1  B1  C1  D1
2   K2  A2  B2  C2  D2
3   K3  A3  B3  C3  D3

In [120]:
# Merge together the DataFrames left_1k and right_1k, even if 
# the rows of both DataFrames does not have the same key values
pd.merge(left_1k, right_1k, how='outer', on=['key1'])

  key1    A    B    C    D
0   K0   A0   B0   C0   D0
1   K1   A1   B1   C1   D1
2   K2   A2   B2   C2   D2
3   K3   A3   B3   C3   D3
4   K4   A4   B4  NaN  NaN
5   K5  NaN  NaN   C5   D5

#### 5.3.2 Merging DataFrames with two keys

In [121]:
# Creating a DataFrame with two keys
left_2k = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
left_2k

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [122]:
# Creating a DataFrame with two keys
right_2k = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right_2k

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [123]:
# Merging together DataFrames left_2k and right_2k, 
# including rows whose values for key1 and key2 does not match
pd.merge(left_2k, right_2k, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [124]:
# Merging together DataFrames left_2k and right_2k, 
# when rows of both DataFrames have the same values for key1 and key2
pd.merge(left_2k, right_2k, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [125]:
# Merge DataFrames left_2k and right_2k, including DataFrame right_2k's rows that
# do not have corresponding keys on DataFrame left_2k's rows
pd.merge(left_2k, right_2k, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [126]:
# Merge DataFrames left_2k and right_2k, including DataFrame left_2k's rows that
# do not have corresponding keys on DataFrame right_2k's rows
pd.merge(left_2k, right_2k, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### 5.3 Joining
Joining is a convenient method for combining the columns of two 
potentially differently-indexed DataFrames into a single result DataFrame.

In [127]:
# Creating a working DataFrame
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [128]:
# Creating a working DataFrame
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [129]:
# Join DataFrames left and right, including left's rows that do not have
# corresponding keys on right's rows
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [130]:
# Join DataFrames left and right, even if
# they do not have corresponding keys
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [131]:
# Join DataFrames left and right only if they
# have corresponding keys
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

## 6. Applying Functions

In [132]:
# Importing Pandas module
import pandas as pd

In [133]:
# Creating a working DataFrame
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [134]:
# Create a function to double the numeric value received as argument
def times2(x):
    return x*2

df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [135]:
# Show the length of col3's values
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [136]:
# Show the sum of col1's values
df['col1'].sum()

10

## 7. Pivot Tables

In [137]:
# Importing Pandas module
import pandas as pd

In [138]:
# Creating a DataFrame
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [139]:
# Set a pivot table
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## 8. Data Input and Output
Pandas can read a variety of file types using its pd.read_ methods, as for example CSV, EXCEL and HTML file types

In [140]:
# Importing Python modules
import numpy as np
import pandas as pd

### 8.1 CSV Files

In [141]:
# Input example.csv file
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [142]:
# Output example2.csv file
df.to_csv('example2.csv',index=False)

### 8.2 Excel Files

In [143]:
# Input a Excel file
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [144]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

### 8.3 HTML Files
We may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [145]:
!pip install lxml

Requirement already satisfied: lxml in d:\instaladores\anaconda\lib\site-packages (4.9.2)

In [146]:
!pip install html5lib

Requirement already satisfied: html5lib in d:\instaladores\anaconda\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in d:\instaladores\anaconda\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in d:\instaladores\anaconda\lib\site-packages (from html5lib) (0.5.1)

In [147]:
!pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in d:\instaladores\anaconda\lib\site-packages (4.11.1)
Requirement already satisfied: soupsieve>1.2 in d:\instaladores\anaconda\lib\site-packages (from BeautifulSoup4) (2.3.1)

In [152]:
# Get some informatin from en.wikipedia.org about London
URL = 'https://en.wikipedia.org/wiki/London'
dfs = pd.read_html(URL)
dfs[0]

,London,London.1
0,Capital city,Capital city
1,Clockwise from top: City of London in the fore...,Clockwise from top: City of London in the fore...
2,.mw-parser-output .locmap .od{position:absolut...,.mw-parser-output .locmap .od{position:absolut...
3,"Coordinates: .mw-parser-output .geo-default,.m...","Coordinates: .mw-parser-output .geo-default,.m..."
4,Sovereign state,United Kingdom
5,Country,England
6,Region,London (Greater London)
7,Ceremonial counties,Greater London (ceremonial county)City of London
8,Local government districts,32 London boroughsand the City of London
9,Settled by Romans,AD 47; 1976years ago[2] as Londinium
10,Government,Government
11,Type,Executive mayoralty and deliberative assembly ...
12,Body,Greater London Authority Mayor Sadiq Khan (L)...
13,LondonAssembly,14 constituencies
14,UKParliament,73 constituencies
15,Area,Area
16,Total[A],"606.96sqmi (1,572.03km2)"
17,Urban,"671.0sqmi (1,737.9km2)"
18,Metro,"3,236sqmi (8,382km2)"
19,City of London,1.12sqmi (2.89km2)
20,32 London boroughs .mw-parser-output .nobold...,"605.85sqmi (1,569.14km2)"
21,Elevation[3],36ft (11m)
22,Population(2021 except where stated),Population(2021 except where stated)
23,Total[A],"8,799,800[1]"
24,Density,"14,500/sqmi (5,598/km2)"
25,Urban(2011)[4],9787426
26,Metro(2019)[5],"14,257,962 (London metropolitan area)"
27,City of London,"8,600[1]"
28,Demonyms,Londoner
29,GVA (2020)[6],GVA (2020)[6]
30,Total,504billion
31,Per capita,"55,974"
32,Time zone,UTC (Greenwich Mean Time)
33,Summer (DST),UTC+1 (British Summer Time)
34,Postcode areas,"22 areas E, EC, N, NW, SE, SW, W, WC, BR, CM, ..."
35,Area codes,"9 area codes 020, 01322, 01689, 01708, 01737, ..."
36,Budget,19.376billion ($25 billion)[7]
37,International airports,Inside London:Heathrow (LHR) City (LCY)Outside...
38,Rapid transit system,London Underground
39,Police,Metropolitan (county of Greater London) City o...
40,Ambulance,London
41,Fire,London
42,GeoTLD,.london
43,Website,www.london.gov.uk